Repository: aaijitechstudio/Balaji_Points
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

source: No Users Found
hi: कोई उपयोगकर्ता नहीं मिला
ta: பயனர்கள் கிடைக்கவில்லை

# tryDifferentSearch
source: Try a different search term
hi: अलग खोज शब्द का प्रयास करें
ta: வேறு தேடல் சொற்களை முயற்சிக்கவும்

# noCarpentersYet
source: No carpenters registered yet
hi: अभी तक कोई बढ़ई पंजीकृत नहीं
ta: தச்சர்கள் இன்னும் பதிவு செய்யவில்லை

# joinedLabel
source: Joined {date}
hi: {date} को शामिल हुए
ta: {date} அன்று சேர்ந்தார்

source: Add Carpenter
hi: बढ़ई जोड़ें
ta: தச்சரை சேர்க்கவும்

# phoneNumberLabel
source: Phone number
hi: फोन नंबर
ta: கைபேசி எண்

# phoneNumberHint
source: e.g. 9876543210 (no +91)
hi: उदा. 9876543210 (बिना +91)
ta: எ.கா. 9876543210 (+91 இல்லாமல்)

source: Enter OTP
hi: OTP दर्ज करें
ta: OTP உள்ளிடவும்

# verifyAndCreate
source: Verify & Create
hi: सत्यापित करें और बनाएं
ta: சரிபார்த்து உருவாக்கவும்

# adminSignOutNote
source: Note: The app will sign in as the verified carpenter temporarily during OTP verification and then sign out. The admin must sign in again.
hi: नोट: OTP सत्यापन के दौरान ऐप अस्थायी रूप से सत्यापित बढ़ई के रूप में साइन इन करेगा और फिर साइन आउट करेगा। व्यवस्थापक को फिर से साइन इन करना होगा।
ta: குறிப்பு: OTP சரிபார்ப்பின் போது தற்காலிகமாக தச்சர் கணக்காக உள்நுழையும். பின்னர் மீண்டும் வெளியேறும். நிர்வாகி மீண்டும் உள்நுழைய வேண்டும்.

source: Carpenter created
hi: बढ़ई बनाया गया
ta: தச்சர் உருவாக்கப்பட்டார்

# carpenterCreatedMessage
source: Carpenter account created successfully. The app has signed in as that carpenter during verification and has now signed out. You will need to sign in again as admin.
hi: बढ़ई खाता सफलतापूर्वक बनाया गया। सत्यापन के दौरान ऐप उस बढ़ई के रूप में साइन इन हो गया है और अब साइन आउट हो गया है। आपको व्यवस्थापक के रूप में फिर से साइन इन करना होगा।
ta: தச்சர் கணக்கு வெற்றிகரமாக உருவாக்கப்பட்டது. தற்காலிகமாக உள்நுழைந்து பின்னர் வெளியேறப்பட்டது. நிர்வாகி மீண்டும் உள்நுழைய வேண்டும்.

# enterValidPhone
source: Enter a valid phone number
hi: एक वैध फोन नंबर दर्ज करें
ta: செல்லுபடியாகும் கைபேசி எண்ணை உள்ளிடவும்

# phoneAlreadyExists
source: Phone number already exists
hi: फोन नंबर पहले से मौजूद है
ta: கைபேசி எண் ஏற்கனவே உள்ளது

source: Verification failed
hi: सत्यापन विफल
ta: சரிபார்ப்பு தோல்வியடைந்தது

source: OTP sent
hi: OTP भेजा गया
ta: OTP அனுப்பப்பட்டது

# failedToSignIn
source: Failed to sign in with OTP
hi: OTP से साइन इन करने में विफल
ta: OTP உள்நுழைவு தோல்வியடைந்தது

source: Auth error
hi: प्रमाणीकरण त्रुटि
ta: அங்கீகார பிழை

# totalPointsLabel
source: Total Points
hi: कुल पॉइंट्स
ta: மொத்த பாயிண்ட்ஸ்

# tierLabel
source: {tier} Tier
hi: {tier} स्तर
ta: {tier} நிலை

source: Recent Activity
hi: हालिया गतिविधि
ta: சமீபத்திய செயல்கள்

source: No activity yet
hi: अभी तक कोई गतिविधि नहीं
ta: ஏதும் செயல்கள் இல்லை

source: No winner yet today
hi: आज अभी तक कोई विजेता नहीं
ta: இன்று இன்னும் வெற்றியாளர் இல்லை

# youWonPrize
source: 🎉 You Won!
hi: 🎉 आपने जीत लिया!
ta: 🎉 நீங்கள் வென்றுள்ளீர்கள்!

# todaysWinnerLabel
source: 🏆 Today's Winner
hi: 🏆 आज के विजेता
ta: 🏆 இன்றைய வெற்றியாளர்

source: My Points
hi: मेरे पॉइंट्स
ta: என் பாயிண்ட்ஸ்

source: Redeem Rewards
hi: पुरस्कार भुनाएं
ta: வெகுமதிகளை ரீடீம் செய்யவும்

source: Leaderboard
hi: लीडरबोर्ड
ta: தரவரிசை பட்டியல்

source: Settings
hi: सेटिंग्स
ta: அமைப்புகள்

# rankShort
source: Rank
hi: रैंक
ta: ரேங்க்

source: Earn
hi: कमाएं
ta: சம்பாதி

source: Approved
hi: स्वीकृत
ta: ஒப்புதல்

source: Add New Bill
hi: नया बिल जोड़ें
ta: புதிய பில் சேர்க்கவும்

source: Recent Bills
hi: हाल के बिल
ta: சமீபத்திய பில்கள்

source: No bills yet
hi: अभी तक कोई बिल नहीं
ta: இன்னும் பில்கள் இல்லை

# submitFirstBill
source: Submit your first bill to earn points
hi: पॉइंट्स अर्जित करने के लिए अपना पहला बिल जमा करें
ta: பாயிண்ட்ஸ் பெற உங்கள் முதல் பிலை சமர்ப்பிக்கவும்

source: Just now
hi: अभी-अभी
ta: இப்பொழுது

# minutesAgo
source: {minutes}m ago
hi: {minutes} मिनट पहले
ta: {minutes} நிமி முன்பு

# hoursAgo
source: {hours}h ago
hi: {hours} घंटे पहले
ta: {hours} மணி முன்பு

# daysAgo
source: {days}d ago
hi: {days} दिन पहले
ta: {days} நாள் முன்பு

# billLabel
source: Bill
hi: बिल
ta: பில்

# statusApproved
source: APPROVED
hi: स्वीकृत
ta: ஒப்புதல்

# statusPending
source: PENDING
hi: लंबित
ta: நிலுவை

# statusRejected
source: REJECTED
hi: अस्वीकृत
ta: நிராகரி

source: Exit App?
hi: ऐप से बाहर निकलें?
ta: ஆப் இலிருந்து வெளியேறவா?

# exitAppMessage
source: Do you want to exit the app?
hi: क्या आप ऐप से बाहर निकलना चाहते हैं?
ta: நீங்கள் ஆப்பிலிருந்து வெளியேற விரும்புகிறீர்களா?

source: Exit
hi: बाहर निकलें
ta: வெளியேறு

source: Discard Changes?
hi: परिवर्तन छोड़ें?
ta: மாற்றங்களை நிராகரிக்கவா?

# discardChangesMessage
source: You have unsaved changes. Do you want to discard them?
hi: आपके पास असहेजित परिवर्तन हैं। क्या आप उन्हें छोड़ना चाहते हैं?
ta: நீங்கள் சேமிக்கப்படாத மாற்றங்கள் உள்ளன. அவற்றை நிராகரிக்க விரும்புகிறீர்களா?

source: Discard
hi: छोड़ें
ta: நிராகரி

source: Press back again to exit
hi: बाहर निकलने के लिए फिर से बैक दबाएं
ta: வெளியேற மீண்டும் பின் செல்லவும்

source: Please wait...
hi: कृपया प्रतीक्षा करें...
ta: தயவுசெய்து காத்திருக்கவும்...

# pleaseWaitForSpin
source: Please wait for spin to complete
hi: कृपया स्पिन पूरा होने तक प्रतीक्षा करें
ta: ஸ்பின் முடியும் வரை காத்திருக்கவும்

source: Discard Bill?
hi: बिल छोड़ें?
ta: பிலை நிராகரிக்கவா?

# discardBillMessage
source: You have unsaved bill data. Do you want to discard it?
hi: आपके पास असहेजित बिल डेटा है। क्या आप इसे छोड़ना चाहते हैं?
ta: நீங்கள் சேமிக்கப்படாத பில் தரவு உள்ளது. அதை நிராகரிக்க விரும்புகிறீர்களா?

# pleaseCompleteProfile
source: Please complete your profile
hi: कृपया अपना प्रोफाइल पूरा करें
ta: தயவுசெய்து உங்கள் சுயவிவரத்தை நிறைவு செய்யவும்

source: Rewards & Loyalty Program
hi: पुरस्कार और वफादारी कार्यक्रम
ta: வெகுமதிகள் & விசுவாச திட்டம்

source: Bill Image
hi: बिल छवि
ta: பில் படம்

source: Bill Date (Optional)
hi: बिल तारीख (वैकल्पिक)
ta: பில் தேதி (விருப்பம்)

source: Store/Vendor Name (Optional)
hi: स्टोर/विक्रेता नाम (वैकल्पिक)
ta: கடை/விற்பனையாளர் பெயர் (விருப்பம்)

source: Bill/Invoice Number (Optional)
hi: बिल/चालान नंबर (वैकल्पिक)
ta: பில்/விலைப்பட்டியல் எண் (விருப்பம்)

source: Notes (Optional)
hi: नोट्स (वैकल्पिक)
ta: குறிப்புகள் (விருப்பம்)

source: Tap to add bill image
hi: बिल छवि जोड़ने के लिए टैप करें
ta: பில் படத்தைச் சேர்க்க தட்டவும்

source: Select bill date (optional)
hi: बिल तारीख चुनें (वैकल्पिक)
ta: பில் தேதியைத் தேர்ந்தெடுக்கவும் (விருப்பம்)

source: Enter store or vendor name (optional)
hi: स्टोर या विक्रेता नाम दर्ज करें (वैकल्पिक)
ta: கடை அல்லது விற்பனையாளர் பெயரை உள்ளிடவும் (விருப்பம்)

source: Enter bill or invoice number (optional)
hi: बिल या चालान नंबर दर्ज करें (वैकल्पिक)
ta: பில் அல்லது விலைப்பட்டியல் எண்ணை உள்ளிடவும் (விருப்பம்)

source: Add any additional notes...
hi: कोई अतिरिक्त नोट्स जोड़ें...
ta: எந்த கூடுதல் குறிப்புகளையும் சேர்க்கவும்...

source: Submit Bill
hi: बिल जमा करें
ta: பிலை சமர்ப்பிக்கவும்

source: Save Changes
hi: परिवर्तन सहेजें
ta: மாற்றங்களை சேமிக்கவும்
