Repository: aaijitechstudio/Balaji_Points
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appName
source: Balaji Points
hi: बालाजी पॉइंट्स
ta: பலாஜி பாயிண்ட்ஸ்

source: Loading...
hi: लोड हो रहा है...
ta: லோடிங்...

source: Error
hi: त्रुटि
ta: பிழை

source: Success
hi: सफल
ta: வெற்றி

source: OK
hi: ठीक है
ta: சரி

source: Cancel
hi: रद्द करें
ta: ரத்து

source: Save
hi: सहेजें
ta: சேமிக்கவும்

source: Delete
hi: मिटाएं
ta: அழிக்கவும்

source: Edit
hi: संपादित करें
ta: திருத்து

source: Submit
hi: जमा करें
ta: சமர்ப்பிக்கவும்

source: Back
hi: वापस
ta: பின் செல்ல

source: Next
hi: अगला
ta: அடுத்தது

source: Done
hi: हो गया
ta: முடிந்தது

source: Retry
hi: पुनः प्रयास
ta: மீண்டும் முயற்சிக்கவும்

source: Refresh
hi: ताज़ा करें
ta: ரிஃப்ரெஷ்

# loginWithPhone
source: Login with Phone Number
hi: फोन नंबर से लॉगिन करें
ta: கைபேசி எண்கொண்டு உள்நுளையவும்

# enterPhoneNumber
source: Enter your registered phone number
hi: अपना पंजीकृत फोन नंबर दर्ज करें
ta: பதிவு செய்யப்பட்ட கைபேசி எண்ணை உள்ளிடவும்

source: Phone Number
hi: फोन नंबर
ta: கைபேசி எண்

# enterPhoneHint
source: Enter 10 digit phone number
hi: 10 अंकों का फोन नंबर दर्ज करें
ta: 10 இலக்க கைபேசி எண்

source: Send OTP
hi: OTP भेजें
ta: OTP அனுப்பவும்

source: Verify OTP
hi: OTP सत्यापित करें
ta: OTP சரிபார்க்கவும்

# enterOTPCode
source: Enter the 6-digit code sent to
hi: 6 अंकों का कोड दर्ज करें
ta: அனுப்பப்பட்ட 6 இலக்க OTP ஐ உள்ளிடவும்

source: Didn't receive OTP?
hi: OTP नहीं मिला?
ta: OTP வரலையா?

source: Resend
hi: पुनः भेजें
ta: மீண்டும் அனுப்பவும்

# resendIn
source: Resend in {seconds}s
hi: {seconds} सेकंड में पुनः भेजें
ta: {seconds} விநாடிகளில் மீண்டும்

# invalidPhone
source: Please enter your phone number
hi: कृपया अपना फोन नंबर दर्ज करें
ta: கைபேசி எண்ணை உள்ளிடவும்

# invalidPhoneLength
source: Phone number must be 10 digits
hi: फोन नंबर 10 अंकों का होना चाहिए
ta: கைபேசி எண் 10 இலக்கமாக இருக்க வேண்டும்

# invalidPhoneFormat
source: Phone number must contain only digits
hi: फोन नंबर में केवल अंक होने चाहिए
ta: கைபேசி எண் இலக்கங்கள் மட்டுமே இருக்க வேண்டும்

# invalidOTP
source: Please enter a valid 6-digit OTP
hi: कृपया 6 अंकों का वैध OTP दर्ज करें
ta: செல்லுபடியாகாத OTP

# selectRole
source: Select Your Role
hi: अपनी भूमिका चुनें
ta: உங்கள் பாத்திரத்தை தேர்வுசெய்க

source: Carpenter
hi: बढ़ई
ta: தச்சர்

source: Admin
hi: व्यवस्थापक
ta: நிர்வாகி

source: Welcome Back
hi: वापस स्वागत है
ta: மீண்டும் வரவேற்கிறோம்

source: Create Account
hi: खाता बनाएं
ta: கணக்கு உருவாக்கு

source: Continue with Phone
hi: फोन से जारी रखें
ta: கைபேசியுடன் தொடரவும்

source: Continue with PIN
hi: PIN के साथ जारी रखें
ta: PIN உடன் தொடரவும்

# loginInfo
source: Login using your registered phone number. You will receive an OTP to verify.
hi: अपने पंजीकृत फोन नंबर का उपयोग करके लॉगिन करें। सत्यापन के लिए आपको एक OTP प्राप्त होगा।
ta: உங்கள் பதிவு செய்யப்பட்ட கைபேசி எண்ணை பயன்படுத்தி உள்நுழைக. OTP அனுப்பப்படும்.

source: Powered by
hi: द्वारा संचालित
ta: இனால் இயக்கப்படுகிறது

# companyName
source: Shree Balaji Plywood & Hardware
hi: श्री बालाजी प्लाईवुड एंड हार्डवेयर
ta: ஸ்ரீ பலாஜி பிளைவுட் & ஹார்ட்வேர்

# enterPinPageTitle
source: Enter your 4-digit PIN
hi: अपना 4 अंकों का PIN दर्ज करें
ta: 4 இலக்க PIN ஐ உள்ளிடவும்

# enter4DigitPin
source: Enter your 4-digit PIN
hi: अपना 4 अंकों का PIN दर्ज करें
ta: 4 இலக்க PIN ஐ உள்ளிடவும்

# pinLabel
source: PIN
hi: पिन
ta: பின்

# fourDigitPin
source: 4-digit PIN
hi: 4 अंकों का PIN
ta: 4 இலக்க PIN

source: Login
hi: लॉगिन
ta: உள்நுளை

source: Forgot PIN?
hi: PIN भूल गए?
ta: PIN மறந்துவிட்டதா?

source: New user? Set PIN
hi: नए उपयोगकर्ता? PIN सेट करें
ta: புதிய பயனரா? PIN அமைக்கவும்

source: Invalid PIN
hi: अमान्य PIN
ta: தவறான PIN

# createPinTitle
source: Create your 4-digit PIN
hi: अपना 4 अंकों का PIN बनाएं
ta: 4 இலக்க PIN உருவாக்கவும்

# createPinSubtitle
source: This PIN will be used for login
hi: यह PIN लॉगिन के लिए उपयोग किया जाएगा
ta: இந்த PIN உள்நுழைவுக்காக பயன்படுத்தப்படும்

source: Mobile Number
hi: मोबाइल नंबर
ta: கைபேசி எண்

source: First Name
hi: पहला नाम
ta: முதல் பெயர்

# firstNameRequired
source: First Name *
hi: पहला नाम *
ta: முதல் பெயர் *

source: Last Name
hi: अंतिम नाम
ta: கடைசி பெயர்

source: Confirm PIN
hi: PIN की पुष्टि करें
ta: PIN உறுதிப்படுத்தவும்

source: Save PIN
hi: PIN सहेजें
ta: PIN சேமிக்கவும்

# pinCreatedSuccess
source: PIN created successfully
hi: PIN सफलतापूर्वक बनाया गया
ta: PIN வெற்றிகரமாக உருவாக்கப்பட்டது

source: Failed to save PIN
hi: PIN सहेजने में विफल
ta: PIN சேமிக்கத் தவறிவிட்டது

# pinsDoNotMatch
source: PIN and Confirm PIN do not match
hi: PIN और पुष्टि PIN मेल नहीं खाते
ta: PIN மற்றும் உறுதிப்படுத்தல் PIN பொருந்தவில்லை

# resetPinTitle
source: Reset PIN
hi: PIN रीसेट करें
ta: PIN மீட்டமைக்கவும்

# resetPinSubtitle
source: Enter your registered mobile number to reset your PIN.
hi: अपना PIN रीसेट करने के लिए अपना पंजीकृत मोबाइल नंबर दर्ज करें।
ta: PIN மீட்டமைக்க பதிவு செய்யப்பட்ட கைபேசி எண்ணை உள்ளிடவும்.

# newPinLabel
source: New 4-digit PIN
hi: नया 4 अंकों का PIN
ta: புதிய 4 இலக்க PIN

source: Check Number
hi: नंबर जांचें
ta: எண் சரிபார்க்கவும்

source: Verified
hi: सत्यापित
ta: சரிபார்க்கப்பட்டது

# pleaseVerifyMobile
source: Please verify mobile number first
hi: कृपया पहले मोबाइल नंबर सत्यापित करें
ta: முதலில் கைபேசி எண்ணை சரிபார்க்கவும்

# noAccountFound
source: No account found for this number
hi: इस नंबर के लिए कोई खाता नहीं मिला
ta: இந்த எண்ணுக்கான கணக்கு இல்லை

# pinResetSuccess
source: PIN reset successfully. Please login again.
hi: PIN सफलतापूर्वक रीसेट किया गया। कृपया फिर से लॉगिन करें।
ta: PIN வெற்றிகரமாக மீட்டமைக்கப்பட்டது. மீண்டும் உள்நுழையவும்.

# failedToResetPin
source: Failed to reset PIN. Try again.
hi: PIN रीसेट करने में विफल। पुनः प्रयास करें।
ta: PIN மீட்டமைக்கத் தவறிவிட்டது. மீண்டும் முயற்சிக்கவும்.

# enterValidTenDigit
source: Enter valid 10-digit number
hi: मान्य 10 अंकों का नंबर दर्ज करें
ta: செல்லுபடியான 10 இலக்க எண்ணை உள்ளிடவும்

source: Enter 4 digits
hi: 4 अंक दर्ज करें
ta: 4 இலக்கங்களை உள்ளிடவும்

source: Enter valid first name
hi: मान्य पहला नाम दर्ज करें
ta: செல்லுபடியான முதல் பெயரை உள்ளிடவும்

source: Image error
hi: छवि त्रुटि
ta: படப் பிழை

source: Reset PIN
hi: PIN रीसेट करें
ta: PIN மீட்டமைக்கவும்

source: Change PIN
hi: PIN बदलें
ta: PIN மாற்றவும்

source: Remember Me
hi: मुझे याद रखें
ta: என்னை நினைவில் வைக்கவும்

# accountExistsUseReset
source: Account already exists. Please use Reset PIN to change your PIN.
hi: खाता पहले से मौजूद है। कृपया अपना PIN बदलने के लिए Reset PIN का उपयोग करें।
ta: கணக்கு ஏற்கனவே உள்ளது. உங்கள் PIN ஐ மாற்ற Reset PIN ஐ பயன்படுத்தவும்.

source: Home
hi: होम
ta: முகப்பு

source: Add Points
hi: पॉइंट जोड़ें
ta: பாயிண்ட்ஸ் சேர்க்கவும்

source: Latest Offers
hi: नवीनतम ऑफर्स
ta: சமீபத்திய ஆஃபர்கள்

# topCarpenters
source: Top 3 Carpenters
hi: शीर्ष 3 बढ़ई
ta: சிறந்த 3 தச்சர்கள்

source: Today's Winner
hi: आज के विजेता
ta: இன்றைய வெற்றியாளர்

source: Your Position
hi: आपकी स्थिति
ta: உங்கள் நிலை

# rank
source: Rank #{rank}
hi: रैंक #{rank}
ta: தரவரிசை #{rank}

# points
source: {points} Points
hi: {points} पॉइंट्स
ta: {points} பாயிண்ட்ஸ்

# noOffersAvailable
source: No offers available at the moment
hi: इस समय कोई ऑफर उपलब्ध नहीं है
ta: தற்போது எந்த ஆஃபர்களும் இல்லை

source: 🎉 Daily Spin Winner
hi: 🎉 दैनिक स्पिन विजेता
ta: 🎉 தினசரி ஸ்பின் வெற்றியாளர்

source: Congratulations!
hi: बधाई हो!
ta: வாழ்த்துக்கள்!

# won
source: Won {points} points!
hi: {points} पॉइंट्स जीते!
ta: {points} பாயிண்ட்ஸ் வென்றுள்ளீர்கள்!

source: Profile
hi: प्रोफाइल
ta: சுயவிவரம்

source: Edit Profile
hi: प्रोफाइल संपादित करें
ta: சுயவிவரம் திருத்து

source: Complete Profile
hi: अपना प्रोफाइल पूरा करें
ta: சுயவிவரத்தை நிறைவு செய்யவும்

source: Profile Incomplete
hi: प्रोफाइल अधूरा
ta: சுயவிவரம் முழுமையில்லை

# completeProfileMessage
source: Please complete your profile to start adding bills and earning points
hi: बिल जोड़ना और पॉइंट्स अर्जित करना शुरू करने के लिए कृपया अपना प्रोफाइल पूरा करें
ta: பில்ல்களைச் சேர்த்து பாயிண்ட்ஸ் பெற உங்கள் சுயவிவரத்தை நிறைவு செய்யவும்

# completeProfileDetails
source: Add your first name, last name, and profile picture to continue
hi: जारी रखने के लिए अपना पहला नाम, अंतिम नाम और प्रोफाइल फोटो जोड़ें
ta: முதல் பெயர், கடைசி பெயர் மற்றும் புகைப்படத்தைச் சேர்க்கவும்

source: Complete Now
hi: अभी पूरा करें
ta: இப்போதே நிறைவு செய்

source: Help & Support
hi: सहायता और समर्थन
ta: உதவி & ஆதரவு

source: Contact Us
hi: संपर्क करें
ta: எங்களை தொடர்பு கொள்ள

source: Dark Mode
hi: डार्क मोड
ta: டார்க் மோட்

source: Logout
hi: लॉगआउट
ta: வெளியேறு

# logoutConfirmation
source: Are you sure you want to logout?
hi: क्या आप वाकई लॉगआउट करना चाहते हैं?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: Name
hi: नाम
ta: பெயர்

source: Email
hi: ईमेल
ta: மின்னஞ்சல்

source: Phone
hi: फोन
ta: கைபேசி

source: Role
hi: भूमिका
ta: பாத்திரம்

source: Member Since
hi: सदस्य बने
ta: உறுப்பினர் ஆன தேதி

source: Total Points
hi: कुल पॉइंट्स
ta: மொத்த பாயிண்ட்ஸ்

source: Not Verified
hi: असत्यापित
ta: சரிபார்க்கப்படவில்லை

source: Need Help?
hi: मदद चाहिए?
ta: உதவி வேண்டுமா?

# contactSupport
source: Contact our support team for any queries or issues.
hi: किसी भी प्रश्न या समस्या के लिए हमारी सहायता टीम से संपर्क करें।
ta: எங்கள் ஆதரவு குழுவை தொடர்பு கொள்ளவும்.

source: Call Now
hi: अभी कॉल करें
ta: இப்போது அழைக்கவும்

# getInTouch
source: Get in touch with us
hi: हमसे संपर्क करें
ta: எங்களை தொடர்பு கொள்ளவும்

source: Mobile
hi: मोबाइल
ta: மொபைல்

source: Landline
hi: लैंडलाइन
ta: லேண்ட்லைன்

source: Add Bill
hi: बिल जोड़ें
ta: பில் சேர்க்கவும்

source: Bill Details
hi: बिल विवरण
ta: பில் விவரங்கள்

source: Bill Number
hi: बिल नंबर
ta: பில் எண்

source: Bill Amount (₹)
hi: बिल राशि
ta: பில் தொகை

source: Bill Date
hi: बिल तारीख
ta: பில் தேதி

source: Upload Bill Image
hi: बिल फोटो अपलोड करें
ta: பில் படத்தை பதிவேற்றவும்

source: Select Image
hi: फोटो चुनें
ta: படத்தைத் தேர்வு செய்

source: Change Image
hi: फोटो बदलें
ta: படத்தை மாற்று

# pointsConversion
source: 1000 ₹ = 1 Point
hi: 1000 ₹ = 1 पॉइंट
ta: ₹1000 = 1 பாயிண்ட்

source: Estimated Points
hi: अनुमानित पॉइंट्स
ta: மதிப்பிடப்பட்ட பாயிண்ட்ஸ்

# youWillEarn
source: You will earn approximately {points} points
hi: आप लगभग {points} पॉइंट्स अर्जित करेंगे
ta: நீங்கள் கணக்கில் {points} பாயிண்ட்ஸ் பெறுவீர்கள்

# enterBillNumber
source: Please enter bill number
hi: कृपया बिल नंबर दर्ज करें
ta: பில் எண்ணை உள்ளிடவும்

source: Enter bill amount
hi: कृपया बिल राशि दर्ज करें
ta: பில் தொகையை உள்ளிடவும்

# enterValidAmount
source: Please enter a valid amount
hi: कृपया वैध राशि दर्ज करें
ta: சரியான தொகையை உள்ளிடவும்

# selectBillDate
source: Please select bill date
hi: कृपया बिल तारीख चुनें
ta: பில் தேதியைத் தேர்வு செய்யவும்

# uploadBillPhoto
source: Please upload bill photo
hi: कृपया बिल फोटो अपलोड करें
ta: பில் புகைப்படத்தை பதிவேற்றவும்

# billSubmitted
source: Bill submitted successfully
hi: बिल सफलतापूर्वक जमा किया गया
ta: பில் வெற்றிகரமாக சமர்ப்பிக்கப்பட்டது

# billSubmitError
source: Failed to submit bill
hi: बिल जमा करने में विफल
ta: பில் சமர்ப்பிப்பு தோல்வியடைந்தது

source: Wallet
hi: वॉलेट
ta: வாலெட்

source: Available Points
hi: उपलब्ध पॉइंट्स
ta: கிடைக்கும் பாயிண்ட்ஸ்

source: Redeem Points
hi: पॉइंट्स भुनाएं
ta: பாயிண்ட்ஸ் ரீடீம்

source: Transaction History
hi: लेनदेन इतिहास
ta: பரிவர்த்தனை வரலாறு

# noTransactions
source: No transactions yet
hi: अभी तक कोई लेनदेन नहीं
ta: பரிவர்த்தனைகள் இல்லை

source: Earned
hi: अर्जित
ta: பெற்றது

source: Spent
hi: खर्च किया
ta: செலவிட்டது

source: Pending
hi: लंबित
ta: நிலுவையில்

source: Offers
hi: ऑफर्स
ta: ஆஃபர்கள்

source: View Details
hi: विवरण देखें
ta: விவரங்களைப் பார்க்க

source: Redeem Now
hi: अभी भुनाएं
ta: இப்போதே ரீடீம் செய்யவும்

# pointsRequired
source: {points} Points Required
hi: {points} पॉइंट्स आवश्यक
ta: {points} பாயிண்ட்ஸ் தேவை

# offerRedeemed
source: Offer redeemed successfully
hi: ऑफर सफलतापूर्वक भुनाया गया
ta: ஆஃபர் வெற்றிகரமாக ரீடீம் செய்யப்பட்டது

source: Insufficient points
hi: अपर्याप्त पॉइंट्स
ta: பாயிண்ட்ஸ் போதவில்லை

# offerExpired
source: This offer has expired
hi: यह ऑफर समाप्त हो गया है
ta: இந்த ஆஃபர் காலாவதியானது

# validUntil
source: Valid until {date}
hi: {date} तक वैध
ta: செல்லுபடியாகும் தேதி: {date}

source: Daily Spin
hi: दैनिक स्पिन
ta: டெய்லி ஸ்பின்

source: SPIN NOW
hi: अभी घुमाएं
ta: இப்போதே ஸ்பின் செய்

source: Spinning...
hi: घूम रहा है...
ta: ஸ்பின் நடக்கிறது...

# spinWheel
source: Spin the Wheel
hi: पहिया घुमाएं
ta: சக்கரத்தை ஸ்பின் செய்

# dailySpinCompleted
source: You have already spun today
hi: आप आज पहले ही घुमा चुके हैं
ta: நீங்கள் இன்று ஏற்கனவே ஸ்பின் செய்துவிட்டீர்கள்

# comeBackTomorrow
source: Come back tomorrow for another chance to win!
hi: जीतने का एक और मौका पाने के लिए कल वापस आएं!
ta: நாளை மீண்டும் முயற்சிக்கவும்!

# nextSpinIn
source: Next spin in: {hours}h {minutes}m
hi: अगला स्पिन: {hours}घंटे {minutes}मिनट में
ta: அடுத்த ஸ்பின்: {hours}மணி {minutes}நிமி

# winner
source: Winner: {name}
hi: विजेता: {name}
ta: வெற்றியாளர்: {name}

# prizePoints
source: 🎁 {points} Points
hi: 🎁 {points} पॉइंट्स
ta: 🎁 {points} பாயிண்ட்ஸ்

source: Admin Panel
hi: व्यवस्थापक पैनल
ta: அட்மின் பேனல்

# adminSubtitle
source: Manage Bills, Offers, Users & Daily Spin
hi: बिल, ऑफर्स, उपयोगकर्ता और दैनिक स्पिन प्रबंधित करें
ta: பில்கள், ஆஃபர்கள், பயனர்கள் & டெய்லி ஸ்பின் மேலாண்மை

source: Dashboard
hi: डैशबोर्ड
ta: டாஷ்போர்ட்

source: Users
hi: उपयोगकर्ता
ta: பயனர்கள்

source: Manage Users
hi: उपयोगकर्ता प्रबंधित करें
ta: பயனர்களை மேலாண்மை செய்

source: Manage Bills
hi: बिल प्रबंधित करें
ta: பில்களை மேலாண்மை செய்

source: Manage Offers
hi: ऑफर्स प्रबंधित करें
ta: ஆஃபர்களை மேலாண்மை செய்

source: Manage Daily Spin
hi: दैनिक स्पिन प्रबंधित करें
ta: டெய்லி ஸ்பின் மேலாண்மை

source: Pending Bills
hi: लंबित बिल
ta: நிலுவை பில்கள்

source: Approved Bills
hi: स्वीकृत बिल
ta: ஒப்புதல் அளிக்கப்பட்ட பில்கள்

source: Rejected Bills
hi: अस्वीकृत बिल
ta: நிராகரிக்கப்பட்ட பில்கள்

source: Pending Users
hi: लंबित उपयोगकर्ता
ta: நிலுவை பயனர்கள்

source: Verified Users
hi: सत्यापित उपयोगकर्ता
ta: சரிபார்க்கப்பட்ட பயனர்கள்

source: Approve
hi: स्वीकृत करें
ta: ஒப்புதல்

source: Reject
hi: अस्वीकार करें
ta: நிராகரி

# userApproved
source: User approved successfully
hi: उपयोगकर्ता सफलतापूर्वक स्वीकृत
ta: பயனர் வெற்றிகரமாக ஒப்புதல் பெற்றார்

# userRejected
source: User rejected successfully
hi: उपयोगकर्ता अस्वीकृत
ta: பயனர் நிராகரிக்கப்பட்டார்

# billApproved
source: Bill approved successfully
hi: बिल सफलतापूर्वक स्वीकृत
ta: பில் வெற்றிகரமாக ஒப்புதல் பெற்றது

# billRejected
source: Bill rejected successfully
hi: बिल अस्वीकृत
ta: பில் நிராகரிக்கப்பட்டது

source: Create Offer
hi: ऑफर बनाएं
ta: ஆஃபர் உருவாக்கு

source: Offer Title
hi: ऑफर शीर्षक
ta: ஆஃபர் தலைப்பு

source: Offer Description
hi: ऑफर विवरण
ta: ஆஃபர் விளக்கம்

# offerCreated
source: Offer created successfully
hi: ऑफर सफलतापूर्वक बनाया गया
ta: ஆஃபர் வெற்றிகரமாக உருவாக்கப்பட்டது

source: Logout failed
hi: लॉगआउट विफल
ta: வெளியேற முடியவில்லை

# errorOccurred
source: An error occurred
hi: एक त्रुटि हुई
ta: பிழை ஏற்பட்டது

# networkError
source: Network error. Please check your internet connection.
hi: नेटवर्क त्रुटि। कृपया अपना इंटरनेट कनेक्शन जांचें।
ta: இணைய பிழை. உங்கள் இணைப்பை சரிபார்க்கவும்.

source: Permission denied
hi: अनुमति अस्वीकृत
ta: அனுமதி மறுக்கப்பட்டது

# sessionExpired
source: Session expired. Please login again.
hi: सत्र समाप्त। कृपया फिर से लॉगिन करें।
ta: செஷன் காலாவதியானது. மீண்டும் உள்நுழைக.

source: Invalid credentials
hi: अमान्य प्रमाण पत्र
ta: செல்லுபடியாகாத தகவல்கள்

source: User not found
hi: उपयोगकर्ता नहीं मिला
ta: பயனர் கிடைக்கவில்லை

# phoneAuthFailed
source: Phone authentication failed
hi: फोन प्रमाणीकरण विफल
ta: கைபேசி சரிபார்ப்பு தோல்வியடைந்தது

# configError
source: Configuration error
hi: कॉन्फ़िगरेशन त्रुटि
ta: கட்டமைப்பு பிழை

# missingClientId
source: SHA-1 fingerprint missing in Firebase. Please run: scripts/get_sha1.sh
hi: Firebase में SHA-1 फ़िंगरप्रिंट गुम है। कृपया चलाएं: scripts/get_sha1.sh
ta: Firebase-ல் SHA-1 இல்லை. scripts/get_sha1.sh ஐ இயக்கவும்.

# tooManyRequests
source: Too many requests. Please wait a few minutes.
hi: बहुत सारे अनुरोध। कृपया कुछ मिनट प्रतीक्षा करें।
ta: அதிகமான கோரிக்கைகள். சில நிமிடங்கள் காத்திருங்கள்.

# invalidVerificationCode
source: Invalid OTP code. Please check and try again.
hi: अमान्य OTP कोड। कृपया जांचें और पुनः प्रयास करें।
ta: செல்லுபடியாகாத OTP

# verificationExpired
source: Verification expired. Please request a new OTP.
hi: सत्यापन समाप्त। कृपया नया OTP अनुरोध करें।
ta: OTP காலாவதியானது

# userDisabled
source: This account has been disabled. Please contact support.
hi: यह खाता अक्षम कर दिया गया है। कृपया समर्थन से संपर्क करें।
ta: இந்த கணக்கு முடக்கப்பட்டுள்ளது

# fieldRequired
source: This field is required
hi: यह फ़ील्ड आवश्यक है
ta: இந்த புலம் அவசியம்

# invalidEmail
source: Please enter a valid email
hi: कृपया वैध ईमेल दर्ज करें
ta: செல்லுபடியாகாத மின்னஞ்சல்

# invalidName
source: Please enter a valid name
hi: कृपया वैध नाम दर्ज करें
ta: செல்லுபடியாகாத பெயர்

# nameTooShort
source: Name must be at least 2 characters
hi: नाम कम से कम 2 अक्षर का होना चाहिए
ta: பெயர் குறைந்தது 2 எழுத்துகள் இருக்க வேண்டும்

# invalidAmount
source: Please enter a valid amount
hi: कृपया वैध राशि दर्ज करें
ta: செல்லுபடியாகாத தொகை

# amountTooLow
source: Amount must be greater than 0
hi: राशि 0 से अधिक होनी चाहिए
ta: தொகை 0-ஐ விட அதிகமாக இருக்க வேண்டும்

# searchHint
source: Search...
hi: खोजें...
ta: தேடுக...

source: No results found
hi: कोई परिणाम नहीं मिला
ta: முடிவுகள் இல்லை

source: No data available
hi: कोई डेटा उपलब्ध नहीं
ta: தரவுகள் இல்லை

source: Pull to refresh
hi: ताज़ा करने के लिए खींचें
ta: ரீஃபிரெஷ் செய்ய இழுக்கவும்

source: Release to refresh
hi: ताज़ा करने के लिए छोड़ें
ta: ரீஃபிரெஷ் செய்ய விடவும்

source: Refreshing...
hi: ताज़ा हो रहा है...
ta: ரீஃபிரெஷ் செய்கிறது...

source: Load more
hi: और लोड करें
ta: மேலும் ஏற்றவும்

source: See All
hi: सभी देखें
ta: அனைத்தையும் காண்க

source: Close
hi: बंद करें
ta: மூடு

source: Confirm
hi: पुष्टि करें
ta: உறுதி செய்

source: Are you sure?
hi: क्या आप सुनिश्चित हैं?
ta: உறுதியாக உள்ளீர்களா?

# cannotUndo
source: This action cannot be undone.
hi: इस क्रिया को पूर्ववत नहीं किया जा सकता।
ta: இந்த செயலை ரத்து செய்ய முடியாது.

source: Yes
hi: हां
ta: ஆம்

source: No
hi: नहीं
ta: இல்லை

source: Today
hi: आज
ta: இன்று

source: Yesterday
hi: कल
ta: நேற்று

source: Tomorrow
hi: आने वाला कल
ta: நாளை

source: January
hi: जनवरी
ta: ஜனவரி

source: February
hi: फरवरी
ta: பிப்ரவரி

source: March
hi: मार्च
ta: மார்ச்

source: April
hi: अप्रैल
ta: ஏப்ரல்

source: May
hi: मई
ta: மே

source: June
hi: जून
ta: ஜூன்

source: July
hi: जुलाई
ta: ஜூலை

source: August
hi: अगस्त
ta: ஆகஸ்ட்

source: September
hi: सितंबर
ta: செப்டம்பர்

source: October
hi: अक्टूबर
ta: அக்டோபர்

source: November
hi: नवंबर
ta: நவம்பர்

source: December
hi: दिसंबर
ta: டிசம்பர்

source: Jan
hi: जन
ta: ஜன்

source: Feb
hi: फर
ta: பிப்

source: Mar
hi: मार
ta: மார்

source: Apr
hi: अप्र
ta: ஏப்

source: Jun
hi: जून
ta: ஜூன்

source: Jul
hi: जुला
ta: ஜூலை

source: Aug
hi: अग
ta: ஆக

source: Sep
hi: सित
ta: செப்

source: Oct
hi: अक्ट
ta: அக்

source: Nov
hi: नव
ta: நவ

source: Dec
hi: दिस
ta: டிச

source: Approve Bill
hi: बिल स्वीकृत करें
ta: பிலை ஒப்புதல் அளி

# approveBillConfirmation
source: Approve bill of ₹{amount} for {phone}?
hi: {phone} के लिए ₹{amount} का बिल स्वीकृत करें?
ta: {phone} க்கான ₹{amount} பிலை ஒப்புதல் அளிக்கவா?

source: Approving bill...
hi: बिल स्वीकृत किया जा रहा है...
ta: பிலை ஒப்புதல் அளிக்கிறது...

# billApprovedSuccess
source: Bill approved!
hi: बिल स्वीकृत हो गया!
ta: பில் ஒப்புதல் பெற்றது!

# failedToApproveBill
source: Failed to approve bill. Try again.
hi: बिल स्वीकृत करने में विफल। पुनः प्रयास करें।
ta: பிலை ஒப்புதல் செய்ய முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

source: Reject Bill
hi: बिल अस्वीकार करें
ta: பிலை நிராகரி

# rejectBillConfirmation
source: Are you sure you want to reject this bill?
hi: क्या आप वाकई इस बिल को अस्वीकार करना चाहते हैं?
ta: இந்த பிலை நிராகரிக்க விரும்புகிறீர்களா?

# billRejectedSuccess
source: Bill Rejected
hi: बिल अस्वीकृत
ta: பில் நிராகரிக்கப்பட்டது

# failedToRejectBill
source: Failed to reject
hi: अस्वीकार करने में विफल
ta: பிலை நிராகரிக்க முடியவில்லை

source: Failed to load image
hi: छवि लोड करने में विफल
ta: படத்தை ஏற்ற முடியவில்லை

source: No image available
hi: कोई छवि उपलब्ध नहीं
ta: படம் இல்லை

source: Error loading bills
hi: बिल लोड करने में त्रुटि
ta: பில்களை ஏற்றும்போது பிழை

source: No Pending Bills
hi: कोई लंबित बिल नहीं
ta: நிலுவை பில்கள் இல்லை

# pendingStatus
source: Pending
hi: लंबित
ta: நிலுவை

source: No date
hi: कोई तारीख नहीं
ta: தேதி இல்லை

source: Delete Offer
hi: ऑफर मिटाएं
ta: ஆஃபரை நீக்கு

# deleteOfferConfirmation
source: Are you sure you want to delete this offer? This action cannot be undone.
hi: क्या आप वाकई इस ऑफर को मिटाना चाहते हैं? इस क्रिया को पूर्ववत नहीं किया जा सकता।
ta: இந்த ஆஃபரை நீக்க விரும்புகிறீர்களா? மீட்டெடுக்க முடியாது.

# offerDeletedSuccess
source: Offer deleted successfully
hi: ऑफर सफलतापूर्वक मिटाया गया
ta: ஆஃபர் வெற்றிகரமாக நீக்கப்பட்டது

source: Failed to delete offer
hi: ऑफर मिटाने में विफल
ta: ஆஃபரை நீக்க முடியவில்லை

source: Error loading offers
hi: ऑफर लोड करने में त्रुटि
ta: ஆஃபர்களை ஏற்றும்போது பிழை

source: No Offers Created
hi: कोई ऑफर नहीं बनाए गए
ta: ஆஃபர்கள் உருவாக்கப்படவில்லை

# createFirstOffer
source: Create your first offer with points and banner
hi: पॉइंट्स और बैनर के साथ अपना पहला ऑफर बनाएं
ta: உங்கள் முதல் ஆஃபரை பாயிண்ட்ஸ் மற்றும் பேனர் உடன் உருவாக்கவும்

source: Active
hi: सक्रिय
ta: செயலில்

source: Inactive
hi: निष्क्रिय
ta: செயலற்றது

# createdLabel
source: Created
hi: बनाया गया
ta: உருவாக்கப்பட்டது

source: Edit Offer
hi: ऑफर संपादित करें
ta: ஆஃபரை திருத்து

source: Create New Offer
hi: नया ऑफर बनाएं
ta: புதிய ஆஃபர் உருவாக்கு

source: Tap to upload banner
hi: बैनर अपलोड करने के लिए टैप करें
ta: பேனரை பதிவேற்ற தட்டவும்

# offerTitleLabel
source: Offer Title *
hi: ऑफर शीर्षक *
ta: ஆஃபர் தலைப்பு *

# offerTitleHint
source: e.g., Diwali Special Offer
hi: उदा., दिवाली विशेष ऑफर
ta: எ.கா., தீபாவளி சிறப்பு ஆஃபர்

# enterOfferTitle
source: Please enter offer title
hi: कृपया ऑफर शीर्षक दर्ज करें
ta: ஆஃபர் தலைப்பை உள்ளிடவும்

# descriptionLabel
source: Description
hi: विवरण
ta: விளக்கம்

# descriptionHint
source: Brief description of the offer
hi: ऑफर का संक्षिप्त विवरण
ta: ஆஃபரின் சுருக்கமான விவரம்

# pointsRequiredLabel
source: Points Required *
hi: आवश्यक पॉइंट्स *
ta: தேவையான பாயிண்ட்ஸ் *

# pointsHint
source: e.g., 100
hi: उदा., 100
ta: எ.கா., 100

# enterPointsError
source: Please enter points
hi: कृपया पॉइंट्स दर्ज करें
ta: பாயிண்ட்ஸை உள்ளிடவும்

# enterValidNumber
source: Please enter a valid number
hi: कृपया एक वैध संख्या दर्ज करें
ta: செல்லுபடியாகாத எண்

# setValidUntilDate
source: Set valid until date (optional)
hi: वैधता तिथि निर्धारित करें (वैकल्पिक)
ta: Valid until தேதியை அமைக்கவும் (விருப்பம்)

# validUntilDisplay
source: Valid until: {date}
hi: {date} तक वैध
ta: செல்லுபடியாகும் தேதி: {date}

source: Offer Status
hi: ऑफर स्थिति
ta: ஆஃபர் நிலை

source: Uploading banner...
hi: बैनर अपलोड हो रहा है...
ta: பேனர் பதிவேற்றுகிறது...

source: Update Offer
hi: ऑफर अपडेट करें
ta: ஆஃபரை புதுப்பிக்கவும்

# offerUpdatedSuccess
source: Offer updated successfully
hi: ऑफर सफलतापूर्वक अपडेट किया गया
ta: ஆஃபர் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# offerCreatedSuccess
source: Offer created successfully
hi: ऑफर सफलतापूर्वक बनाया गया
ta: ஆஃபர் வெற்றிகரமாக உருவாக்கப்பட்டது

source: Failed to save offer
hi: ऑफर सहेजने में विफल
ta: ஆஃபரை சேமிக்க முடியவில்லை

source: Failed to pick image
hi: छवि चुनने में विफल
ta: படத்தைத் தேர்வு செய்ய இயலவில்லை

source: Search by name or phone...
hi: नाम या फोन से खोजें...
ta: பெயர் அல்லது கைபேசி எண்ணால் தேடவும்...

source: Add
hi: जोड़ें
ta: சேர்க்கவும்

source: All
hi: सभी
ta: அனைத்தும்

source: Platinum
hi: प्लेटिनम
ta: பிளாட்டினம்

source: Gold
hi: गोल्ड
ta: கோல்டு

source: Silver
hi: सिल्वर
ta: சில்வர்

source: Bronze
hi: ब्रॉन्ज
ta: ப்ரான்ஸ்

source: Error loading users
hi: उपयोगकर्ता लोड करने में त्रुटि
ta: பயனர்களை ஏற்றும்போது பிழை
